app/controllers/tweet_favs_controller.rb

  def create
    @tweet_fav = TweetFav.create(user_id: current_user.id, tweet_id: params[:tweet_id])
    @tweet = Tweet.find(params[:tweet_id])
    if @tweet.user.notification
      RelationshipMailer.notify_fav_to_tweet(current_user, @tweet.user, @tweet).deliver
    end
    if @tweet.user.id != current_user.id
      Notification.create(
        user_id: @tweet.user.id,
        notified_by_id: current_user.id,
        notification_type: :fav_to_tweet,
        message: "#{@tweet.content}",
        link: "/tweets/#{@tweet.id}"
      )
---
INSERT INTO `tweet_favs` (`user_id`, `tweet_id`, `created_at`, `updated_at`) VALUES (2, 3, '2018-05-18 10:00:37', '2018-05-18 10:00:37')
SELECT  `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 3 LIMIT 1
INSERT INTO `notifications` (`user_id`, `notified_by_id`, `notification_type`, `message`, `link`, `created_at`, `updated_at`) VALUES (1, 2, 0, '頑張ります', '/tweets/2', '2018-05-18 10:00:43', '2018-05-18 10:00:43')

  def destroy
    @tweet_fav = TweetFav.find_by(user_id: current_user.id, tweet_id: params[:tweet_id])
    @tweet_fav.destroy
    @tweet = Tweet.find(params[:tweet_id])
---
SELECT  `tweet_favs`.* FROM `tweet_favs` WHERE `tweet_favs`.`user_id` = 2 AND `tweet_favs`.`tweet_id` = 3 LIMIT 1
DELETE FROM `tweet_favs` WHERE `tweet_favs`.`id` = 1
SELECT  `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 3 LIMIT 1