app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
    @followings = @user.followings
    @followers = @user.followers
    all_tweets = Tweet.where(user_id: params[:id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1
SELECT `tweets`.* FROM `tweets` WHERE `tweets`.`user_id` = 1